#+TITLE: 100 Days Of Code - Log

** Thoughts

Optional arguments in OCaml

#+BEGIN_SRC ocaml
let concat ?sep x y =
  let sep = match sep with None -> "" | Some x -> x in
  x ^ sep ^ y

#+END_SRC

#+RESULTS:
: val concat :
:   ?sep:Base.String.t -> Base.String.t -> Base.String.t -> Base.String.t =
:   <fun>

And also could same results

#+BEGIN_SRC ocaml
let concat ?(sep="") x y = x ^ sep ^ y
#+END_SRC

#+RESULTS:
: val concat :
:   ?sep:Base.String.t -> Base.String.t -> Base.String.t -> Base.String.t =
:   <fun>

when without optional arguments

#+BEGIN_SRC ocaml
concat "A" "B"

#+END_SRC

#+RESULTS:
: "AB"

Need optional arguments

#+BEGIN_SRC ocaml
concat ~sep:":" "A" "B"

#+END_SRC

#+RESULTS:
: "A:B"

#+BEGIN_SRC ocaml
concat "A" ~sep:":" "B"
 
#+END_SRC

#+RESULTS:
: "A:B"

When to erase optional arguments

#+BEGIN_SRC ocaml
let prepend_pound = concat "# "
#+END_SRC

#+RESULTS:
: <fun>

#+BEGIN_SRC ocaml
prepend_pound "a BASH comment"
#+END_SRC

#+RESULTS:
: "# a BASH comment"

#+BEGIN_SRC ocaml
prepend_pound "a BASH comment" ~sep:":" "Hello"
#+END_SRC

#+RESULTS:
: Characters 0-13:
:   prepend_pound "a BASH comment" ~sep:":" "Hello";;
:   ^^^^^^^^^^^^^
: Error: This function has type Base.String.t -> Base.String.t
:        It is applied to too many arguments; maybe you forgot a `;'.

Somthing Wrong happened.

 Characters 0-13:
   prepend_pound "a BASH comment" ~sep:":";;
   ^^^^^^^^^^^^^
 Error: This function has type Base.String.t -> Base.String.t
        It is applied to too many arguments; maybe you forgot a `;'.

Optional arguments is earsed as soon as the first positional arguments defined
after the optional argument is passed in 


** Thoughts
+ How to writing efficient recursive functions in functional language
+ How to use accumulators as technigue to make some function tail recursive
  
#+BEGIN_SRC sml
fun sum1 xs = 
    case xs of 
        [] -> 0
     | i:xs' => i + sum1 xs';;

#+END_SRC

#+RESULTS:
: stdIn:10.12 Error: syntax error found at ARROW

#+BEGIN_SRC sml
fun sum2 xs = 
    let fun f (xs,acc) = 
            case xs of 
                [] -> acc
             | i::xs' => f(xs', i+acc)
    in 
        f(xs,0)
    end;;

#+END_SRC

#+RESULTS:
: stdIn:4.20 Error: syntax error found at ARROW

Both functions compute the same results, but sumw using a local helper function
takes an extra arguments, called acc for "accumulators"

** Thoughts

let <variable> = <expr>

expr can be function or variable 

#+BEGIN_SRC ocaml
let x = 3;;

#+END_SRC

#+RESULTS:
: 3

but in ocaml can't use record in let 
#+BEGIN_SRC ocaml
let x = {name : Stone}

#+END_SRC


: Characters 21-22:
:   let x = {name : Stone};;
:                        ^
: Error: Syntax error

When function in let expr 

#+BEGIN_SRC ocaml
let transforms = [ String.uppercase, String.lowercase ]
#+END_SRC

#+RESULTS:
: val transforms :
:   ((Base.string -> Base.string) * (Base.string -> Base.string)) Base__List.t =
:   [(<fun>, <fun>)]


** Thoughts
*Two Different Ways of Thinking*

#+BEGIN_SRC ocaml
let rec append a b = 
  match a with
    [] -> b
  | h::t -> h :: append t b

#+END_SRC

#+RESULTS:
: <fun>

To imagine the actions the computer might take to calculate the result:

+ Look at the first. If it is empty, return the second list, Otherwise, pull
  apart the first list, looking at its head and tail. Make a recursive call
  to append the tail to the second list, and then cons the head onto the 
  result. Return this.
  
Consider each match case to be an independent statement of truth, thinking the 
same way about the whole function

+ The empty list appende to another list is that list, Otherwise, the first list
  is non-empty, so it has a head and tail , Call them h and t, Clearly append 
  (h :: t) b is equal to h :: append t b, Since this reduces the problem size, 
  progress is made.

  
*** Maps and Filters

Higher-order function over lists

#+BEGIN_SRC sml
fun map (f, xs) = 
    case xs of
        [] => []
     | x::xs' => (f x)::(map(f, xs'));; 

#+END_SRC

#+RESULTS:

val map = fn : ('a -> 'b) * 'a list -> 'b list


The map function takes a list and a function f and produces a new 
list by applying f to each element of the list. Here are two example uses:

#+BEGIN_SRC sml
fun increment x = x + 1
#+END_SRC

#+RESULTS:
 val increment = fn : int -> int

#+BEGIN_SRC sml
val x1 = map (increment, [4, 8, 12, 16])

#+END_SRC

#+RESULTS:
 val x1 = [5,9,13,17] : int list

#+BEGIN_SRC sml
val x2 = map (hd, [[1,2], [3,4], [5,6,7]])

#+END_SRC

#+RESULTS:
 val x2 = [1,3,5] : int list

The definition and use of map is an incredibly important idiom 
even though our particular example is simple. We could have easily
written a recursive function over lists of integers that incremented
all the elements, but instead we divided the work into two parts: 
The map implementer knew how to traverse a recursive data structure, 
in this case a list. The map client knew what to do with the data there, 
in this case increment each number. You could imagine either of these 
tasks — traversing a complicated piece of data or doing some calculation 
for each of the pieces — being vastly more complicated and best done by 
different developers without making assumptions about the other task. That 
is exactly what writing map as a helper function that takes a function lets us do.

Here is a second very useful higher-order function for lists
#+BEGIN_SRC sml
fun filter (f, xs) = 
    case xs of 
        [] -> []
     |  x::xs' => if f x
                     then x::(filter (f, xs'))
                     else filter (f, xs');;
#+END_SRC

#+RESULTS:
: stdIn:21.10-21.16 Error: syntax error: deleting  RBRACKET ARROW LBRACKET

*** Returning functons
#+BEGIN_SRC sml
fun double_or_triple f = 
      if f 7
      then fn x => 2*x
      else fn x => 3*x;;

#+END_SRC

#+RESULTS:
val double_or_triple = fn : (int -> bool) -> int -> int


*** Not just for numbers and lists
Because ML programs tend to use lists a lot, you might forget
that higher-order functions are useful for more than lists. Some
of our first examples just used integers. But higher-order functions 
also are great for our own data structures. Here we use an is_even 
function to see if all the constants in an arithmetic expression are 
even. We could easily reuse true_of_all_constants for any other property 
we wanted to check. 
 
#+BEGIN_SRC sml
datatype exp = Constant of int | Negate of exp | Add of exp * exp | Multiply of exp * exp;;
#+END_SRC

#+RESULTS:
: datatype exp
:   = Add of exp * exp | Constant of int | Multiply of exp * exp | Negate of exp

#+BEGIN_SRC sml

fun true_of_all_constants(f,e) =
    case e of
     Constant i => f i
   | Negate e1  => true_of_all_constants(f, e1)
   | Add(e1,e2) => true_of_all_constants(f,e1) andalso true_of_all_constants(f,e2)
   | Multiply(e1,e2) => true_of_all_constants(f,e1) andalso true_of_all_constants(f,e2);;

#+END_SRC

#+RESULTS:

val true_of_all_constants = fn : (int -> bool) * exp -> bool

#+BEGIN_SRC sml
fun all_even e = true_of_all_constants(is_even,e);;

#+END_SRC

#+RESULTS:

*** First-class functions
+ First-class functions: Can use them wherever we use values
  + Functions are values too
  + Arguments, results, parts of tuples, bound to variables,
    carried by datatype constructors or exceptions, ...
    
#+BEGIN_SRC sml
fun double x = 2 * x;;
fun incr x = x + 1;;
val a_tuple = (double, incr, double(incr 7));;
#+END_SRC

#+RESULTS:
: val incr = fn : int -> int
Function Closures
+ Function closure: Functions can use bindings from outside the function
  definition (in scope where function is defined)
  - Makes first-class functions much more powerful
  - Will get to this feature in a bit, after simpler examples
+ Distinction between terms first-class functions and function closures is not universally understood
  - Important conceptual distinction even if terms get muddled

